//
//  PostData.swift
//  Navigation
//
//  Created by Денис Валько on 24.02.2025.
//

import Foundation

let postData: [postModel] = [
    postModel(author: "Клиент всегда прав",
              description: "Пиво с пиццей «Маргарита» создали питерские пивовары. Это саур эль с помидорами, сыром моцарелла и базиликом.\n\nПроизводители обещают перенести каждого на поля итальянской фермы после первого глотка.",
              image: "post2",
              likes: 33,
              views: 234),
    postModel(author: "Сегодня в тренде",
              description: "Вкусвилл выпустил бальзам для губ «Блин» к Масленице. Всего за 255 рублей ваши губы будут блестеть как после съеденного блинчика с маслом.",
              image: "post1",
              likes: 122,
              views: 454),
    postModel(author: "Сегодня в тренде",
              description: "В Telegram теперь можно подарить… НОСКИ. Павел Дуров ночью добавил новый пак подарков к 23 февраля.\n\nНе хватает бандла с гелем для бритья и набором инструментов 😮",
              image: "post3",
              likes: 1,
              views: 88),
    postModel(author: "Клиент всегда прав",
              description: "KitKat выпустил батончики со вкусом сладкой ваты — они идут в ассорти с ванильными и шоколадными вкусами.",
              image: "post4",
              likes: 564,
              views: 955)
]
